{"Name": "Snapshot Basic", "Description": "Affordable and dependable point-and-shoot camera designed for everyday photography, offering straightforward operation and reliable performance for casual photographers who want to capture their daily moments with ease.", "Price": "$99", "Rating": 4.0, "Resolution": "16 MP", "Ideal For": "Casual photographers"}
{"Name": "ZoomMaster Pro", "Description": "Compact digital camera featuring a powerful zoom lens capability, allowing photographers to capture clear and detailed images of distant subjects with ease.", "Price": "$199", "Rating": 4.2, "Resolution": "20 MP", "Ideal For": "Travel and wildlife enthusiasts"}
{"Name": "UltraWide Explorer", "Description": "High-performance camera featuring a professional ultra-wide lens system, perfect for capturing expansive and breathtaking landscape shots with remarkable clarity and stunning depth.", "Price": "$299", "Rating": 4.3, "Resolution": "24 MP", "Ideal For": "Landscape photographers"}
{"Name": "VlogStar HD", "Description": "High-definition digital camera featuring a versatile flip screen display, making it an ideal choice for vlogging and content creation with clear, professional-quality results.", "Price": "$399", "Rating": 4.4, "Resolution": "18 MP", "Ideal For": "Vloggers and content creators"}
{"Name": "ActionCam Xtreme", "Description": "Durable and resilient action camera featuring crisp 4K video recording capabilities, designed to capture all your outdoor adventures and memorable moments with exceptional clarity and detail.", "Price": "$499", "Rating": 4.5, "Resolution": "12 MP", "Ideal For": "Outdoor enthusiasts and athletes"}
{"Name": "Portrait Master 5D", "Description": "High-performance digital camera featuring a sophisticated large sensor that delivers exceptional image quality and depth, making it the perfect tool for capturing stunning portrait photography with remarkable detail and professional-looking background blur.", "Price": "$699", "Rating": 4.6, "Resolution": "30 MP", "Ideal For": "Professional portrait photographers"}
{"Name": "NightVision Pro", "Description": "Camera featuring sophisticated low-light performance and enhanced sensor technology, delivering exceptional clarity and detail in nighttime photography and dark environments for consistently sharp nocturnal shots.", "Price": "$799", "Rating": 4.7, "Resolution": "22 MP", "Ideal For": "Night photographers"}
{"Name": "Mirrorless Magic", "Description": "Compact and lightweight mirrorless camera system featuring interchangeable lens compatibility, allowing photographers to adapt their setup for various shooting scenarios and creative styles. The versatile design makes it ideal for both casual and serious photography needs.", "Price": "$899", "Rating": 4.8, "Resolution": "26 MP", "Ideal For": "Photography enthusiasts and professionals"}
{"Name": "StudioPro DSLR", "Description": "Professional-grade DSLR camera system offering robust and advanced features specifically designed for demanding studio photography requirements and controlled lighting environments.", "Price": "$1,299", "Rating": 4.9, "Resolution": "45 MP", "Ideal For": "Studio and commercial photographers"}
{"Name": "CineMaster 8K", "Description": "High-end professional camera system featuring advanced 8K video recording capabilities designed for premium cinematic productions and sophisticated filmmaking projects.", "Price": "$2,499", "Rating": 5.0, "Resolution": "50 MP", "Ideal For": "Filmmakers and cinematographers"}
