{"Name": "Benebone Puppy Fishbone Dog Chew Toys, Softer for Modest Chewers, Made in USA", "average_rating": "4.7", "Description": "['DURABLE, WITH A LITTLE GIVE – Benebones are for determined chewers. Our puppy line is durable and quite firm to the human touch, but is a teeny bit more forgiving for teething pups.'\n 'REAL FISH! – We use only 100% REAL JACK SALMON for flavor. Trust us, puppies can tell the difference.\\xa0 And the best part is, we can’t smell it.'\n 'EASY TO PICK UP AND CHEW – Our adorable little Fishbone is curved for a paw-friendly grip so your pup can quickly grab them and get a good chew going. Think about it: puppies don’t have thumbs.'\n 'USA MADE - We make and source everything in the USA.'\n \"HAPPINESS, GUARANTEED - Have an issue? Want to chat? Reach out to us directly and you'll get a real person whose sole job is to make you and your pup happy.\"]", "Price": "12.27"}
{"Name": "Benebone Tripe Bone Durable Dog Chew Toy for Aggressive Chewers, Real Tripe, Made in USA, Small", "average_rating": "4.7", "Description": "['DURABLE, LONG-LASTING – Super chewer? Bring it on. Benebones are tougher than real bones and last for weeks.'\n 'REAL TRIPE AND NO STINK! – We use only 100% REAL BEEF TRIPE for flavor. We know what you’re thinking…tripe stinks. That’s true, but with a bit of Benebone magic, your pup will dig it, and you won’t smell a thing!'\n 'EASY TO PICK UP AND CHEW – This squiggly chew is curved for a paw-friendly grip so your pup can quickly grab it and get a good chew going. Think about it: dogs don’t have thumbs.'\n 'POCKETS FOR AN EXTRA SURPRISE! – Stuff some peanut butter or cheese into the little pocket on the ends. As if tripe flavor wasn’t enough!'\n 'USA MADE – We make everything in the USA.'\n \"HAPPINESS, GUARANTEED - Have an issue? Want to chat? Reach out to us directly and you'll get a real person whose sole job is to make you and your pup happy.\"]", "Price": "10.97"}
{"Name": "HOMDSG Dog Toy Holder Stopper Compatible with Classic Sizes X-S to XX-L, Only Plastic Paw Plug Included, Red, 4 Pack", "average_rating": "4.7", "Description": "[\"The tapered stopper can effectively stop the leakage of liquid food, so you don't have to worry about drips when preparing food for your dog.\"\n 'The paw-shaped base can perfectly support the dog toy without tipping over, so it is convenient for you to put it in the refrigerator for freezing and save space.'\n 'The tapered plug design is compatible with classic all sizes (X-S/S/M/L/X-L/XX-L).'\n 'Paw stopper are made of safe plastic, BPA free, dishwasher safe.'\n 'Ensure Stopper is removed before giving the toy to your dog.']", "Price": "11.99"}
{"Name": "BAODANTECH Squeaky Large Dog Plush Toys for Dogs,Stuffed Durable Scorpion Dog Toys with Cotton for for Small Medium Large Dogs", "average_rating": "4.8", "Description": "['Soft and Durable Plush Toys:Built in soft cotton, tightly reinforced seams. Dogs can play longer with the plush dog toys.'\n \"Squeaker and Attractive:Squeaks quickly attract the dog's attention and stimulate their interest in playing, whether it's pulling or dragging.\"\n 'The Happiness of Dogs: Chewing toys or playing with dog toys can reduce the anxiety and tooth grinding of dogs.'\n 'Large Dog Plush Toys: Suitable for large dogs, medium dogs,small dogs.'\n 'Warm tips:NOT FOR AGGRESSIVE CHEWERS,Especially extremely aggressive dogs.']", "Price": "11.99"}
{"Name": "House of Puppies Dog Toys for Aggressive Chewers with Durable Natural Rubber - for Teething and Dental Care (Medium, Aqua)", "average_rating": "4.7", "Description": "['AGGRESSIVE CHEWERS: Crafted from our natural rubber formula. Rough and durable enough to satisfy even the most Aggressive chewers.'\n 'GREAT FOR STUFFING: Stuff it up with your own treats! With an inner hollow for treats or peanut butter, the House of Puppies chew toy provides hours of fun and satisfaction for your pet.'\n 'EASE TEETHING AND BOOST DENTAL HYGINENE: Our product helps ease teething for puppies and young adults while our unique design simultaneously enhances dental health. Additionally, our unique shape makes it easy for your pet to grip and chew – Making it ideal for teething puppies and larger dogs alike.'\n 'SIZING: The Medium size is made dogs weighing 15-35 lbs (7-16 kg). The Large size is made for dogs weighing 30-65 lbs (13-30 kg).'\n 'TOUGH AND LONG-LASTING MATERIAL: Our chew toy has been designed to withstand all gnawing, chewing, and roughhousing your pet can dish out. Get ready for the lots of happy tail-wagging with the HOUSE OF PUPPIES Chew Toy!']", "Price": "15.99"}
{"Name": "BAODANTECH Large Dog Squeaky Plush Toys for Dogs,Stuffed Durable Dog Toys with Cotton for for Small Medium Large Dogs-Parrot", "average_rating": "4.6", "Description": "['Soft and Durable Plush Toys:Built in soft cotton, tightly reinforced seams. Dogs can play longer with the plush dog toys.'\n \"Squeaker and Attractive:Squeaks quickly attract the dog's attention and stimulate their interest in playing, whether it's pulling or dragging.\"\n 'The Happiness of Dogs: Chewing toys or playing with dog toys can reduce the anxiety and tooth grinding of dogs.'\n 'Large Dog Plush Toys: Suitable for large dogs, medium dogs,small dogs.'\n 'Warm tips:NOT FOR AGGRESSIVE CHEWERS,Especially extremely aggressive dogs.']", "Price": "11.99"}
{"Name": "Doudele Large Rubber Dog Bone -", "average_rating": "4.8", "Description": "[]", "Price": "16.99"}
{"Name": "Aipper Dog Puppy Toys 20 Pack, Puppy Chew Toys for Fun and Teeth Cleaning, Dog Squeak Toys,Treat Dispenser Ball, Tug of War Toys, Puppy Teething Toys, Dog Rope Toys Pack for Medium to Small Dogs", "average_rating": "4.5", "Description": "['Amazing Dog Toys & Super Fun: 20 Packs cute puppy toys for puppy and small dogs. includes 5 cute dog squeaky plush toys, dog treat dispenser ball, rubber toothbrush toy, 7 rope dog toys, tug of war toy, flying Dog Toy, 3 extra poop bag rolls & 1 bag dispenser as a gift. Now paying less to get more toys than others. More dog toys keep your friend more playtime, more fun, stay happy and healthy.'\n 'Clean teeth & Keep Healthy: Dogs are chewers by nature, when teething, boredom, loneliness, stress or energy relief will chew everything in the house, by chewing our natural cotton rope toys and rubber bone toys with soft spikes, dogs get gum massage and stress relief. These puppy teething toys not only clean the incisors but also help to clean dental plaque which hides in the dead corner, remove it and prevent decay. Keeping your puppy have healthy chewing behavior.'\n 'Interactive toys & Improve relationship: A tired dog is a good dog! Playtime keeps dogs physically fit and mentally sharp. Various rope toys are great for tug of war, fetch, and chewing. Flying toys, ball toy and squeaky toys as dog training toys to keep them stay focused, so you can train them efficiently. These pet toys positively enhance the relationship between you and your dogs. Enjoy more fun playing with your furry friend.'\n \"Cute Dog Squeaky Toys: includes Squeaky Dog Toys and 5 Plush Squeaky toys (duck, banana, strawberry and Crab), Dogs like to explore the surrounding environment through sound. These squeaky toys will attract the dog's interest and satisfy the dog's hunting instinct.\"\n 'Great Quality & Perfect Gift Set: Our dog toys undergo rigorous quality testing. Well-made of organic cotton, natural rubber, non-toxic,great for dogs. We Are So Certain That Your Dog Puppy Will Love These Dog Toys,Buy it with confident, these dog puppy toys are perfect gifts for your furry friend!'\n 'WARM TIPS & Excellence Service: Please kindly note these toys are not for aggressive chewers.Like every other toy, these puppy chew toys are not indestructible. We recommend supervised play, and timely replacement of the broken ones,These dog toys Can Not be Eaten or Swallowed. Feel free to contact us before or after your purchase with any questions or concerns, we will give you a satisfactory solution.']", "Price": "18.99"}
{"Name": "Natural Rubber Dog Bone for Hours of Chewing and Play", "average_rating": "5.0", "Description": "['Durable and chew-resistant: made from high-quality natural rubber, this bone is tough enough to withstand the chewing and playing habits of even the most enthusiastic dogs'\n \"Promotes dental health: the bone's unique shape and texture helps to clean teeth and massage gums, reducing the risk of dental problems and bad breath in your dog.\"\n 'Suitable for all dog breeds: whether you have a small or large dog, this bone is the perfect size and shape for all breeds.']", "Price": "12.99"}
{"Name": "JetPup Human Pup Chew Toy (Blue)", "average_rating": "5.0", "Description": "['Not a Pet Toy' 'Human Puppy Play' '100% Food Grade Silicone'\n 'No BPA or Toxins' 'Dishwasher Safe' 'Chew Toy For Humans']", "Price": "19.99"}
{"Name": "Doudele Dog tire chew Toy - Large Tough Dog chew Toys for Aggressive chewers", "average_rating": "4.6", "Description": "[]", "Price": "9.99"}
{"Name": "HOMDSG Mushroom Silicone Stopper and Holder for (Size L & XL) Dog Chew Freezer Toy, Plug and Stander Make Enrichment Prep Easier, 2 Pack", "average_rating": "4.7", "Description": "[\"Prepping your dog's favorite treat has never been easier. Just use our silicone stoppers and holders to make your enrichment prep a lot easier!\"\n 'Stoppers prevent snacks or liquids like water or broth from leaking. Simply push the plug into the hole in the dog toy to create a watertight seal.'\n 'The round stand acts as a base to keep your enrichment toys from wobbling during preparation.'\n 'Cute mushroom shaped stopper, suitable for size L dog enrichment toys, see pictures for compatible toys.'\n 'Includes 2 plugs and 2 stands, food grade silicone, dishwasher safe.']", "Price": "13.95"}
{"Name": "Doudele Chew Toy Rubber Bone - Toothbrush Stick Toy Aggressive Chewers,Puppy Teething Chew Toy,Indestructible Dog Toys for Small Medium Breeds", "average_rating": "4.4", "Description": "[]", "Price": "12.99"}
{"Name": "Keeyteek 2PCS Dog Toys for Aggressive Chewers, Durable Nylon Bones for Dogs, Dog Teething Toys with Bacon Flavor for Large/Medium/Small Breeds, Pet Dog Chew Toys", "average_rating": "4.4", "Description": "['【Durable Nylon Dog Toys】This is a dog chew toys for aggressive chewers. It has the characteristics of sturdiness, bite resistance, safety and beauty. Tough nylon is not easy to be bitten by dogs. and is the best choice for dogs to chew.'\n '【Bacon Flavored Dog Bones】Interactive dog toys for aggressive chewers, with a bacon flavor, which is more attractive to dogs and makes dogs more willing to engage in interaction or games. Such as daily indoor or outdoor obstacle training, tracking training, bite games, etc. At the same time, it can increase the tacit understanding between dogs and people and establish a good degree of trust.'\n '【Best Toy Gifts for Dogs】Dog toys for large dogs aggressive chewers, simulate the shape of real bones, making it easier for your dog to recognize, chew and play, reduce their anxiety and boredom, and avoid loneliness. At the same time, avoid dogs from biting clothes, shoes, sofas and other furniture.'\n \"【Outdoor Sports Dog Bone Toys】Dog bones for aggressive chewers are easy to carry and are ideal for dogs to exercise outdoors or interact with their owners. Chewing will stimulate the dog's desire, stimulate the dog's hunting instinct, let the dog release a certain amount of energy, reduce the dog's depression, and make your dog full of energy every day.\"\n '【Suitable for Multi-breed Dogs】This pet toys for dogs has been chew-tested on most dog breeds, including: German Shepherds, Golden Retrievers, French Bulldogs, Labrador Retrievers, English Corgis, Huskies and more, and get loved by the dogs. Large Bone Size: 6.2*2.2 inches, Medium Bone Size: 5.3*1.9 inches. Packing Quantity: 2 Pieces.']", "Price": "17.99"}
{"Name": "Vibrant Life Dental Buddy", "average_rating": "5.0", "Description": "[]", "Price": "6.99"}
{"Name": "Kong Freezer Holder with Built in Plugs Kong Stand Dog Enrichment (Medium)", "average_rating": "5.0", "Description": "['-Kong size correlates with size of holder. Precision fit for each size of kong'\n '-Built in plugs to help stop liquid or soft foods from falling out'\n '-Designed to save space and store kongs perfectly next to each other'\n '-Height of walls prevents toppling over'\n '-Flat bottom allows it to sit on freezer shelves']", "Price": "14.99"}
{"Name": "Interactive Squeaky Dog Chew Toy - Cleans Dogs Teeth - Tough and Durable for Aggressive Chewers, Suitable for Small, Medium, and Large Breeds. Features Chew Corn Stick Design", "average_rating": "4.5", "Description": "[\"Built to Last: Crafted with high-quality materials and durable construction, this corn chew toy is built to withstand the rigorous chewing of even the most aggressive dogs, making it a long-lasting addition to your dog's toy collection.\"\n \"Dental Health Benefits: The textured surface of the corn toy helps clean your dog's teeth and massage their gums, promoting good dental hygiene and reducing plaque and tartar buildup.\"\n 'Safe for All Breeds: Suitable for small, medium, and large breeds, this chew toy is made from durable, non-toxic materials that are safe for your furry friend to chew on without any health risks.'\n \"Promotes Positive Behavior: By redirecting your dog's chewing behavior towards this toy, it helps discourage destructive chewing on furniture, shoes, or other household items, promoting positive chewing habits.\"\n \"Easy to Clean: The corn chew toy can be easily cleaned by rinsing with water or wiping it down, ensuring hygiene and maintaining the toy's durability for prolonged use.\"]", "Price": "10.99"}
{"Name": "Pet Dog Tooth Grinding Stick Bones Toys for Chewers,2 Pack Beef Flavor Indestructible Dog Teething Chew Toys,for Large/Medium/Small Puppies Breeds Clean Teeth（Samll）", "average_rating": "4.7", "Description": "['Dog chew toys: made of quality nylon and edible cowhide, it is safe and reliable for dogs to chew, sturdy and not easy to break, help clean teeth and control plaque and tartar during the chewing process'\n 'Indestructible dog chew bone: especially designed for 30-60lbs, medium and large sized aggressive chewers, it is hard to destroy, and the dog chew bone is suitable for German Shepherds, Siberian Huskies, Labradors, Golden Retriever and many other powerful chewing dogs; Long lasting and nice for medium, large breeds dogs'\n 'Bone shape design: the realistic bone shape makes your pet easy to recognize, establishes a positive connection with the dog toy, and reduces their anxiety and boredom; Interesting and curved design makes it easy for dogs to hold and chew; These toys are also infused with beef flavoring, you can put pumpkin puree, and mashed potatoes on the toy as well to make them appealing to your dog'\n 'Nylon dog toys: this aggressive chewer dog chew toy is medium and small, small one is about 1.57 x 4.13 inches/ 4 x 10.5 cm, medium one is about 1.97 x 5.12 inches/ 5 x 13 cm; The nylon materials that can stand up against the intense chewing of strong chewers; Please note that puppy can chip off very small pieces and leave tooth marks on the chew toy, they may swallow debris, and proper supervision is recommended'\n 'Surprise gifts for our dog: choosing the dog stick toys for your dog can provide comfort and keep them entertained; Stay away from cooked turkey, chicken, and pork bones as they can easily splinter; The interactive toys are good choices for holiday or birthday gifts for pet owners and pet lovers, which can contribute to a strong relationship between you and your dog'\n 'Warm prompt: The size of this product may have 1-2cm error if measured manually. Please understand.']", "Price": "15.67"}
{"Name": "Doudele Small Dog Chew Toy - Medium Dog Holiday 3-Pack, Puppy Toys for Aggressive Chewer,Tough Chew Toys for Teething,Beef Flavor", "average_rating": "4.3", "Description": "[]", "Price": "15.99"}
