{"Name": "FrenchPress Classic", "Description": "Traditional French press coffee maker designed to deliver a rich, full-bodied, and flavorful cup of coffee through its time-tested brewing method, allowing complete control over the steeping process.", "Price": "$29", "Rating": 4.1, "Capacity": "4 cups", "Ideal For": "French press enthusiasts"}
{"Name": "SingleServe Wonder", "Description": "Compact and convenient single-serve coffee machine designed for effortless brewing, delivering your perfect cup of coffee quickly and efficiently. This space-saving appliance offers a straightforward solution for your daily caffeine needs.", "Price": "$59", "Rating": 3.9, "Capacity": "1 cup", "Ideal For": "Individuals on-the-go"}
{"Name": "QuickBrew Express", "Description": "Fast and efficient coffee maker designed to deliver a quick and flavorful cup of coffee whenever you need your daily caffeine boost.", "Price": "$89", "Rating": 4.0, "Capacity": "1 cup", "Ideal For": "Busy individuals"}
{"Name": "BrewMaster Classic", "Description": "Durable and easy-to-use coffee maker featuring a timeless design that combines functionality with elegant aesthetics. Built to last and simple to operate, this appliance brings convenience to your daily coffee routine.", "Price": "$129", "Rating": 4.2, "Capacity": "12 cups", "Ideal For": "Home use"}
{"Name": "ColdBrew Master", "Description": "This specialized brewing machine is expertly designed to create perfectly smooth and consistently refreshing cold brew coffee, delivering a rich and low-acid coffee experience with every batch.", "Price": "$199", "Rating": 4.3, "Capacity": "6 cups", "Ideal For": "Cold brew lovers"}
{"Name": "Grind&Brew Plus", "Description": "Modern coffee machine featuring a built-in grinder mechanism that automatically processes whole beans, ensuring a fresh and aromatic cup of coffee with each and every brew.", "Price": "$349", "Rating": 4.4, "Capacity": "10 cups", "Ideal For": "Coffee purists"}
{"Name": "EspressoMaster 2000", "Description": "Compact and efficient espresso machine featuring advanced brewing technology that delivers consistently perfect coffee. This sleek unit combines modern engineering with precise temperature control for optimal extraction.", "Price": "$399", "Rating": 4.5, "Capacity": "2 cups", "Ideal For": "Espresso lovers"}
{"Name": "LatteArt Pro", "Description": "Advanced and sophisticated coffee machine featuring a professional-grade built-in milk frother system, designed to create perfectly textured and creamy lattes and cappuccinos with barista-quality results in the comfort of your home.", "Price": "$599", "Rating": 4.6, "Capacity": "2 cups", "Ideal For": "Latte and cappuccino lovers"}
{"Name": "Cappuccino King", "Description": "This premium, sophisticated machine delivers exceptional, professional-grade cappuccinos with perfect consistency and rich, velvety foam. A top-tier appliance designed for creating barista-quality beverages with outstanding results every time.", "Price": "$799", "Rating": 4.7, "Capacity": "2 cups", "Ideal For": "Cappuccino aficionados"}
{"Name": "CafePro Elite", "Description": "Professional-grade coffee machine featuring advanced brewing capabilities and multiple customizable options for coffee preparation, all housed within an elegant and sleek design that enhances any kitchen or office space.", "Price": "$899", "Rating": 4.8, "Capacity": "4 cups", "Ideal For": "Coffee enthusiasts and small cafes"}
