{"Name": "WOZIFAN Laptop Windows 11 14\" 6GB DDR4 128GB SSD Intel N4020 (Up to 2.8Ghz)2-Core Computer 1920x1080 FHD Dual WIFI BT 4.2 Mini HDMI Support 512GB TF 1TB SSD Expand for Work Study Entertainment-Silver", "average_rating": "5.0", "Description": "['【Powerful Productivity】This 14-inch Win 11 laptop is equipped with Intel N4020 DUAL-CORE processor performance, delivers unmatched speed. Run multiple apps and browser tabs and videos smoothly, ensuring faster multitasking and enjoying immersive entertainment, work and study.'\n '【STORAGE AND MEMORY】6GB RAM boosts your performance. Plus, hard drive with 256 GB SSD,with M.2 SATA expansion slot, Support up to connect 512GB external storage space and support 1TB SSD expansion, plenty of space and faster read and write speeds for your documents, photos and videos.'\n '【CONNECTIVITY and PORTS】5000mAh large battery, Sleep standby for up to 200 hours, 5-6 hours of video playback. With 2.4G+5G WiFi and Bluetooth 4.2, Using dual USB3.0, and Mini HDMI available slots(Adapters required),this Win laptop allows you to expand to multiple devices, achieve fast wireless transmission and smooth network in any place like coffee shop, library or even travel.'\n \"【Light and convenient】W8 laptop weighs only 1.32 kilograms, and the computer screen can be rotated 180 degrees, Equipped with a 14-inch large screen.This laptop features 1920x1080 Full HD. You'll get immersive, brilliant colors and great clarity during a movie, e-learning, or video meeting.\"\n '【Win 11 AND SERVICE】Experience the most secure Win ever built with increased responsiveness, packed with Silicone keyboard protection film, At the same time, Laptop has 1+1 year VIP service. If you encounter any problems, we will have professional technicians to help you solve them.Perfect gift choice for family,friends and child.']", "Price": "249.99"}
{"Name": "Lenovo ThinkPad L14 14\" Touchscreen FHD 300nits Business Laptop, Intel Quard-Core i5-1135G7 (Beat i7-1065G7), 8GB DDR4 RAM, 256GB PCIe SSD, WiFi 6, BT 5.1, Windows 10 Pro, BROAG Extension Cable", "average_rating": "4.9", "Description": "['CPU: 11th Gen Intel Core i5-1135G7 Processor @ 2.40GHz(4 Cores, 8 Threads, 8M Cache, up to 4.20 GHz).'\n 'Display: 14\" FHD (1920x1080) IPS 300nits Anti-glare, Touchscreen; Graphics: Intel Iris Xe Graphics.'\n 'RAM: 8GB SO-DIMM DDR4-3200 Memory; Hard Drive: 256GB SSD M.2 2280 PCIe x4 NVMe Opal2.'\n 'Connectivity: Intel Wi-Fi 6E AX210, 11ax 2x2 + BT5.1; Ports: 1x USB 3.2 Gen 1, 1x USB 3.2 Gen 1 (Always On), 1x USB-C 3.2 Gen 1 (support data transfer, Power Delivery 3.0 and DisplayPort 1.4), 1x Thunderbolt 4 / USB 4 40Gbps (support data transfer, Power Delivery 3.0, and DisplayPort 1.4), 1x HDMI 2.0, 1x microSD card reader, 1x Headphone / microphone combo jack (3.5mm).'\n 'Bundled with BROAG USB Extension Cable. OS: Windows 10 Pro 64, English; Non-backlit, English (US). Color: Black.']", "Price": "629.0"}
{"Name": "HP EliteBook 850 G8 15.6\" FHD Business Laptop Computer, Intel Quad-Core i7-1165G7, 16GB DDR4 RAM, 1TB PCIe SSD, WiFi 6, BT 5.1, Backlit Keyboard, Fingerprint Reader, Windows 11 Pro, BROAG HDMI Cable", "average_rating": "5.0", "Description": "['CPU: 11th Generation Intel Core i7-1165G7 Processor @ 2.80GHz (4 Cores, 8 Threads, 12MB Cache, up to 4.7 GHz).'\n 'Display: 15.6\" diagonal, FHD (1920 x 1080), IPS, anti-glare, 45% NTSC; Graphics: Intel Iris Xᵉ Graphics; 720p HD IR privacy camera with Audio by Bang & Olufsen, dual stereo speakers, 3 multi array microphone.'\n 'RAM: 16GB DDR4-3200 MHz Memory; Hard Drive: 1TB PCIe NVMe SSD.'\n 'Connectivity: Intel AX201 Wi-Fi 6 (2x2) and Bluetooth 5 combo, vPro; 2 Thunderbolt 4 with USB4 Type-C 40Gbps signaling rate (USB Power Delivery, DisplayPort 1.4); 2 SuperSpeed USB Type-A 5Gbps signaling rate (1 charging); 1 Stereo headphone/microphone combo jack; 1 HDMI 2.0b; 1 AC power.'\n 'Bundled with BROAG HDMI Cable. OS: Windows 11 Pro 64, English; Spill-resistant, Backlit Keyboard with numeric keypad; Fingerprint Reader. Color: Silver.']", "Price": "1109.0"}
{"Name": "Acer Aspire 1 A115-32-C96U Slim Laptop 15.6\" FHD (Intel Celeron N4500, 16GB RAM, 256GB PCIe SSD, UHD Graphics) Home & Student, 1-Year Office 365, Ethernet, Wi-Fi, Webcam, IST HDMI, Win 11 Home Silver", "average_rating": "5.0", "Description": "['Aspire 1, an entry-level, light workload configuration laptop featuring lightweight and fast processing, perfect for everyday multitasking; Microsoft 365 Personal, Get full access to Microsoft Excel, Word, PowerPoint, OneNote, Access, and 1 TB of One Drive storage for 1 year.'\n 'Intel Celeron N4500 Processor (2 cores 2 threads, base clock speed 1.1GHz, max turbo to 2.8GHz, 4MB Cache); 16GB DDR4 RAM, 256GB PCIe NVMe M.2 SSD'\n '15.6-inch Full HD (1920 x 1080) LCD, 60Hz Refresh Rate, 16:9 Narrow bezel Display; Integrated Intel UHD Graphics; Support to expandable with the monitor via HDMI Ports. Max resolution of the External Monitors: 4K (3840*2160) @60Hz'\n 'USB 2.0 Port, 2 x USB 3.2 Gen 1 Type-A, HDMI, RJ-45 Ethernet port, Headphone / microphone combo jack; Wi-Fi 5 802.11ac + Bluetooth 5.0; HD Webcam; 8 Hours Battery Life'\n 'Brand New Computer has been resealed to upgrade the Memory or SSD. One-year warranty from the manufacturer. Three-year warranty for upgraded Memory/SSD for Issaquah Highlands Tech customers. Windows 11 Home 64-bit, Ideal for Family Entertainment, School Education, Daily Productivity, Casual Gaming, Streaming, Online Class, Remote Learning, Zoom Meeting, Video Conference, etc.']", "Price": "329.98"}
{"Name": "ASUS ZenBook Pro Duo 15 OLED 15.6\" FHD Touchscreen Business Laptop, Intel Octa-Core i9-11900H, 32GB DDR4 RAM, 1TB PCIe SSD, GeForce RTX 3060, WiFi 6, Backlit KB, Windows 11 Pro, BROAG HDMI Cable", "average_rating": "4.9", "Description": "['▌Up-graded ▌Seal is opened for up-grade. Up-grade from base: 32GB DDR4 RAM, 1TB PCIe SSD; 1 year warraty on up-graded RAM/SSD from Seller, and original 1-Year Manufacture warranty on remaining components. Powered by 11th Generation Intel Core i9-11900H Processor @ 2.50GHz(8 Cores, 24MB Cache, up to 4.9 GHz).'\n 'Display: 15.6\" 440nits FHD (1920 x 1080) NanoEdge OLED HDR touchscreen and the ASUS ScreenPad Plus secondary display; It includes the ASUS ScreenPad Plus secondary display with a brand-new tilting design that offers effortless ergonomics and seamless workflows.Graphics: NVIDIA GeForce GTX 3060'\n '32GB DDR4 Memory; 1TB PCIe NVMe M.2 SSD'\n 'Intel WiFi 6 (802.11ax)+ Bluetooth 5.0; 2 x Thunderbolt 4 USB-C, 1 x USB 3.2 Gen 2 Type-A, 1 x HDMI 2.1, 1 x DC-in, 1 x Audio combo jack.'\n 'Bundled with BROAG HDMI Cable. Windows 11 Professional (64-bit). Backlit keyboard; Celestial Blue']", "Price": "1869.0"}
{"Name": "Lenovo Legion 5 15.6\" Gaming Laptop 120Hz Ryzen 5-4600H 8GB RAM 512GB SSD GTX 1660 Ti 6GB - 120 Hz Refresh Rate", "average_rating": "4.7", "Description": "['【15.6\" FHD 120Hz Display】1920 x 1080 resolution boasts impressive color and clarity. Anti-glare Energy-efficient IPS 250 Nit screen.'\n '【AMD Ryzen 5-4600H Processor】Ultra-low-voltage platform. 6-core, 12-way processing provides maximum high-efficiency power to go. Dolby Atmos, 2x 2W Stereo Speakers & 720p HD camera with Privacy Shutter, with dual array microphones.'\n '【8GB DDR4 RAM】Plenty of high-bandwidth RAM to smoothly run your games as well as multiple programs. 【512GB PCIe SSD】Save files fast and store more data. With plenty amounts of storage and advanced communication power, great for major gaming, multiple servers, backups, and more.'\n '【Backlit Keyboard】Allows you to enjoy comfortable and accurate typing, even in dim lighting.【NVIDIA GeForce RTX 1660Ti Graphics】with 6GB GDDR6 video memory provide solid image quality for Internet use, movies, basic photo editing and casual gaming.'\n '【Windows 10 included】4-cell Lithium- Polymer battery. 10.22 x 14.3 x 0.87, 5.5 lbs. Ports: 4x USB Type-A, 1x USB Type-C, 1x Headset, 1x HDMI, 1x RJ-45. Wireless-AX + Bluetooth, Black. Bonus 32GB SnowBell USB Card.']", "Price": "849.0"}
{"Name": "Lenovo ThinkPad T14 14” WQXGA Business Laptop, Intel Core i5-1235U (Beats i7-1165g7),16GB RAM, 1TB SSD, Backlit KB, Fingerprint Reader, Webcam, Wi-Fi 6E, Bluetooth, Black, Win 10 Pro, 32GB USB Card", "average_rating": "4.7", "Description": "['【Upgraded】Seal is opened for upgrade only, 1-Year warranty on Upgraded RAM/SSD from SnowBell, and original 1-Year Manufacture warranty on remaining components.【14\" WQXGA Display】 Experience stunning clarity and vibrant colors with its 1920 x 1200p resolution. Designed for extended usage, this display offers a perfect balance of brilliance and comfort, ensuring you can work on your projects for hours on end without strain.'\n '【Intel Core i5-1235U Processor】Discover this 10-core, 12-way process, a powerful and efficient choice for everyday computing tasks. With its 933MHz higher RAM speed and 4 additional CPU threads compared to the Intel Core i7-1165G7, enjoy enhanced multitasking and smoother performance. Plus, benefit from a 13W lower TDP, consuming less power and ensuring cooler operation. Experience the perfect balance of performance and efficiency, elevating your digital encounters to new heights.'\n '【16GB RAM】Seamlessly tackle resource-intensive tasks, smoothly run multiple applications simultaneously, and enjoy blazing responsiveness that keeps you in the flow.【1TB PCIe SSD】Delivers lightning-fast boot-up speed, enhanced storage capabilities, and support for high-definition video playback. Effortlessly store an extensive digital library and access your virtual world with ease.'\n '【Backlit Keyboard】Illuminates your laptop experience for effortless typing and improved accuracy in low-light environments. 【Compact Design】 Ultraportable weight of 2.92lbs and thickness of 0.70”. Carry it in any bag and create on the go. 【Intel Iris Xe Graphics】Enhance your business capabilities with a graphics solution that ensures smooth visuals and efficient data visualization, empowering you to achieve professional success with amplified productivity.'\n '【Windows 10 Pro】Embrace natural controls that empower you to think, express and create in an efficient way, all within an ultra-secure environment. 【Fingerprint Reader】Enhance laptop security with seamless fingerprint authentication, ensuring convenient access while protecting your data and personal information. 【Port & Accessories】2 x USB 3.2 Type-C, 2 x USB 2.0 Type-A, 1 x RJ45, 1 x Kensington Security Slot, 1 x Headphone, 1 x HDMI.Wi-Fi 6E + Bluetooth. Black. Bonus 32GB SnowBell USB Card.']", "Price": "899.0"}
{"Name": "HP Laptop, 14” FHD Display, Intel Celeron N4500 Processor, 8GB RAM, 512GB PCIe SSD, HDMI, Bluetooth, Webcam, SD Media Card Reader, Windows 11 Home, Black", "average_rating": "4.8", "Description": "['【Memory & Storage】The PC memory has been upgraded to 8GB DDR4 SDRAM for enhanced high bandwidth to easily switch back and forth between open applications; Hard drive has been upgraded to 512GB PCIe NVMe M.2 SSD for fast boot up and speedy data transfer'\n '【Processor】Intel Celeron N4500 (2 Cores, 2 Threads, Base Frequency at 1.1 GHz, Up to 2.8 GHz at Burst Frequency, 4MB L3 Cache), with integrated Intel UHD Graphics'\n '【Screen】14\" diagonal, FHD (1920 x 1080), IPS, micro-edge, BrightView, 250 nits'\n '【Tech Specs】1 x SuperSpeed USB Type-C, 2 x SuperSpeed USB Type-A, 1 x HDMI, 1 x Headphone/Microphone Combo, 1 x AC Power, 1 x Multi-format SD media card reader; 802.11 ac/b/g/n (1x1) Wi-Fi and Bluetooth 4.2 combo'\n '【Authorized KKE Mousepad】Include KKE Mousepad, Authorized Sellers ONLY']", "Price": "439.0"}
{"Name": "HP 2023 Newest 15.6\" Touchscreen Laptop, 12GB RAM, 256GB SSD, Intel Core i3-1115G4 Processor, 11 H Battery Life, Wi-Fi, Bluetooth, Webcam, HDMI, Windows 11 Home in S Mode", "average_rating": "4.6", "Description": "['【Processor】Equipped with Intel Core i3-11154G processor (up to 4.1 GHz with Intel Turbo Boost Technology, 6 MB L3 cache, 2 cores), The high-performance configuration allows you enjoy impressive creating.'\n '【15.6-inch Touchscreen HD Display】15.6-inch diagonal, HD (1366 x 768), Touch, Micro-edge. The biggest advantage of a touchscreen laptop is that it can be an effective supplement to a mouse or keyboard. This technology-filled design allows people to experience the ease of operation when facing the management of mailboxes when traveling and waiting in long queues.'\n '【Upgrade】Up to 32GB RAM to run your games and photo and video editing applications smoothly at the same time, as well as multiple programs and browser tabs. Up to 2TB SSD storage boots up in seconds, accessing files faster, and leaving room for file loading with lightning-fast SSDs.'\n '【Connectivity】Stay connected with 802.11a/b/g/n/ac (2x2) Wi-Fi and Bluetooth 5 combo, and 2 USB Type-A, SuperSpeed USB Type-C, Multi-format SD media card reader, an HDMI port, a headphone/microphone combo jack.'\n '【 Windows 11 Operating System】Enjoy the convenience and security of Windows 11 Home in S Mode. Compared with Windows 10, Windows 11 Home in S Mode has all the power and security of with a redesigned and refreshed look. It brings new tools, sounds, and apps. Every detail has been considered. All of it comes together to bring you a refreshing experience on your PC.']", "Price": "492.0"}
{"Name": "Dell 2023 Vostro 3520 15.6\" FHD Business Laptop Computer, 12th Gen Intel 10-Cores i7-1255U up to 4.7GHz, 8GB DDR4 RAM, 512GB PCIe SSD, 802.11ac WiFi, Bluetooth, Carbon Black, Windows 11 Pro", "average_rating": "5.0", "Description": "['CPU: 12th Gen Intel Core i7-1255U, 10C (2P + 8E) / 12T, P-core 1.7 / 4.7GHz, E-core 1.2 / 3.5GHz, 12MB.'\n 'Display: 15.6\" FHD (1920x1080) Anti Glare, Non-Touch, WVA, 250 nits, Narrow Border, LED-Backlit Display, FHD IR Camera; Graphics: Intel Iris Xᵉ Graphics.'\n 'RAM: 8GB DDR4 3200MHz Memory; Hard Drive: 512GB M.2 PCIe NVMe SSD.'\n 'Connectivity: 802.11ac 1x1 WiFi, Bluetooth wireless card; 2 USB 3.2 Gen 1 port (on systems UMA with non Type-C), 1 USB 2.0 port, 1 headset (headphone and microphone combo) port, 1 HDMI 1.4 port, 1 RJ45 Ethernet port (flip-down).'\n 'OS: Windows 11 Professional 64, English; Carbon Black.']", "Price": "799.0"}
{"Name": "MSI 2023 Cyborg 15 15.6\" 144Hz FHD Gaming Laptop Computer, 12th Gen Intel 10-Core i7-12650H, GeForce RTX 4060 8GB, 16GB DDR5 RAM, 1TB PCIe SSD, WiFi 6, Backlit Keyboard, Windows 11, BROAG HDMI Cable", "average_rating": "4.7", "Description": "['12th Gen Intel Core i7-12650H, 10C (6P + 4E) / 16T, P-core 2.3 / 4.7GHz, E-core 1.7 / 3.5GHz, 24MB.'\n '15.6\" FHD (1920 x 1080) 16:9, IPS-Level 144Hz 45%NTSC Display; NVIDIA GeForce RTX 4060 8GB GDDR6 Graphics.'\n '16GB DDR5 RAM; 1TB M.2 NVMe PCIe SSD; No Optical drive'\n 'Intel Wi-Fi 6 AX201(2*2 ax)+Bluetooth 5.2; 2x USB 3.2 Gen1, 1x USB 3.2 Gen1 w/DP1.4, 1x HDMI 4K @ 60Hz, 1x RJ45 LAN port.'\n 'Bundled with BROAG HDMI Cable. Windows 11 Home, 64-bit, English; Blue keyboard with Anti-Ghost key (99 Key).']", "Price": "1139.0"}
{"Name": "Dell Latitude 5420 14\" Touchscreen FHD Business Laptop, Intel Quad-Core i5-1145G7 (Beat i7-1065G7), 16GB DDR4 RAM, 1TB PCIe SSD, WiFi 6, Bluetooth, Fingerprint Reader, Backlit Keyboard, Windows 10 Pro", "average_rating": "4.8", "Description": "['CPU: 11th Gen Intel Core i5-1145G7 Processor @ 2.40GHz (4 Cores, 8 Threads, 8M Cache, up to 4.20 GHz).'\n 'Display: 14\" FHD (1920x1080) Touchscreen, 60 Hz, Anti-Glare, 72% NTSC, 300 nits, wide-viewing angle; Graphics: Intel Iris Xᵉ Graphics; 720p at 30 fps, widescreen HD RGB camera, Dual-array microphones.'\n 'RAM: 16GB DDR4-3200 MHz Memory; Hard Drive: 1TB PCIe NVMe SSD.'\n 'Connectivity: Intel AX201 Wi-Fi 6 2x2 and Bluetooth.'\n 'OS: Windows 10 Pro 64, English (Free Upgrade to Windows 11 Pro When Available); Single Point keyboard English US with Backlit; Fingerprint Reader. Color: Gray.']", "Price": "849.0"}
{"Name": "HP 17 17.3\" Touchscreen HD+ Laptop Computer, Quad-Core AMD Ryzen 3 5300U (Beat i3-1115G4), 8GB DDR4 RAM, 256GB PCIe SSD, WiFi 6, Bluetooth 5.2, Natural Silver, Windows 11 Home, BROAG HDMI Cable", "average_rating": "4.8", "Description": "['AMD Ryzen 3 5300U Processors @ 2.60GHz (4 cores, 8 threads, 4 MB L3 cache, up to 3.8 GHz max boost clock)'\n '17.3\" diagonal, HD+ (1600 x 900), Touchscreen, BrightView, 250 nits, 60% NTSC Display; AMD Radeon Graphics.'\n '8GB DDR4-3200 MHz RAM; 256GB PCIe NVMe M.2 SSD.'\n 'Realtek Wi-Fi 6 (1x2) and Bluetooth 5.2 combo (Supporting Gigabit data rate); 1 SuperSpeed USB Type-C 5Gbps signaling rate; 2 SuperSpeed USB Type-A 5Gbps signaling rate; 1 HDMI 1.4b; 1 AC smart pin; 1 headphone/microphone combo.'\n 'Bundled with BROAG HDMI Cable. Windows 11 Home, 64-bit; Natural Silver.']", "Price": "499.0"}
{"Name": "ASUS 2023 Newest Vivobook Laptop, 14\" HD Display, 8GB RAM, 128GB PCIe SSD, AMD Ryzen 3 3250U Processor Up to 3.5GHz,USB Type-C, Wi-Fi, HDMI, Windows 11 in S Mode, Light and Thin, Grey", "average_rating": "4.6", "Description": "['【Fast & Efficient】 The AMD Ryzen 3 processor and 8GB of RAM let you run programs smoothly on the 14-inch HD display. This ASUS notebook PC has 128GB SSD that shortens load times and offers ample storage., the ASUS Vivobook laptop will help you get things done swiftly and efficiently.'\n '【Processor】AMD Ryzen 3 3250U Processor (2 Cores, 4 Threads, 2.60 GHz Base Clock, Up to 3.50 GHz Max Boost Clock)'\n \"【Immersive Visuals】 14'' HD Comfortable Display The 14'' HD (1600 x 768) display gives you wider viewing angles for a better experience across the board, providing better color accuracy and contrast, while the display's narrow bezels give you more available viewing screen. Energy-efficient LED backlight.\"\n '【Extremely Portable】 This ultra thin laptop is only 3.53 lbs and 0.78 inches thin, meaning it will easily slip into a backpack to be taken anywhere you need to go.'\n '【Operating System】Windows 11 Home in S Mode. Windows 11 has all the power and security of Windows 10 with a redesigned and refreshed look. It also comes with new tools, sounds, and apps. Every detail has been considered. All of it comes together to bring you a refreshing experience on your PC']", "Price": "369.99"}
{"Name": "HP 2023 Omen 17 Gaming Laptop, Full Power GeForce RTX 4080 12GB 175W, 17.3\" 165Hz QHD (2560x1440), 13th Gen Intel 24-Core i9-13900HX, 16GB DDR5 RAM, 1TB PCIe SSD, WiFi 6E, BT 5.3, RGB KB, Windows 11", "average_rating": "5.0", "Description": "['13th Gen Intel Core i9-13900HX Processor @ 2.2GHz (24 cores, 32 threads, 36 MB L3 cache, up to 5.4 GHz).'\n 'Display: 17.3\" diagonal, QHD (2560 x 1440), 165 Hz, 3 ms response time, IPS, micro-edge, anti-glare, Low Blue Light, 300 nits; Graphics: NVIDIA GeForce RTX 4080 12GB GDDR6X, 175W Max TGP (Total Graphics Power).'\n 'RAM: 16GB DDR5-5600 MHz Memory; Hard Drive: 1TB PCIe NVMe TLC M.2 SSD.'\n 'Connectivity: Realtek Wi-Fi 6E (2x2) and Bluetooth 5.3 compatible combo (Supporting Gigabit data rate). Ports: 1 USB Type-A 5Gbps signaling rate (HP Sleep and Charge); 2 USB Type-A 5Gbps signaling rate; 1 AC smart pin; 1 HDMI 2.1; 1 headphone/microphone combo; 1 mini DisplayPort; 1 RJ-45; 1 Thunderbolt 4 (40Gbps signaling rate) with USB Type-C 10Gbps signaling rate (USB Power Delivery, DisplayPort 1.4, HP Sleep and Charge).'\n 'Bundled with BROAG USB Extension Cable. Windows 11 Home; Full-size, 4-zone RGB backlit, shadow black keyboard and 26-Key Rollover Anti-Ghosting Key technology; 330 W Smart AC power adapter.']", "Price": "3049.0"}
{"Name": "Lenovo Newest Ideapad 3 17.3\" FHD Business Laptop, AMD Ryzen 5 5625U(6 Cores, Up to 4.3GHz), 8GB RAM, 512GB NVMe SSD, Fingerprint, Webcam, Fullsize KB, WiFi 6, HDMI, Type-A&C, Win 11, GM Accessories", "average_rating": "4.8", "Description": "['【Large Screen】17.3\" FHD (1920x1080) IPS 300nits Anti-glare, Narrow edge, 72% NTSC≈100% sRGB. Large high gamut Full HD screen can display content more vividly and clearly, both office and entertainment are very comfortable.'\n '【Performance Guarantee】 AMD Ryzen 5 5625U, 6 Cores & 12 Threads, 2.30GHz Base Clock, Up to 4.3GHz Boost Clock, 16MB Cache. 7 Cores AMD Radeon Graphics. This processor has ultra-low power consumption while maintaining the high performance of multi-core and multi-threaded, so you can use it for longer without charging.'\n '【Upgraded to 8GB DDR4 RAM】Substantial high-bandwidth RAM to smoothly run your games and photo- and video-editing applications, as well as multiple programs and browser tabs all at once.'\n '【Upgraded to 512GB NVMe SSD】Speedy solid-state drive for seanless performance and reliable multitasking, allows you to store a large number of files, improving the reading speed of large files, ensuring daily use and the speed of opening large files, reduce the time of application and file loading.'\n '【Multiple Connection】1 x USB-A 2.0, 1 x USB-A 3.2 Gen 1, 1x USB-C 3.2 Gen 1 (support data transfer, Power Delivery 3.0 and DisplayPort 1.2), 1 x HDMI 1.4b, 1 x Card reader, 1 x Headphone / microphone combo jack (3.5mm), Fingerprint Reader, WIFi 6, Fullsize KeyBoard.']", "Price": "669.0"}
{"Name": "HP EliteBook 640 G9 14\" FHD Business Laptop (Intel 10-Core i5-1235U, 16GB RAM, 1TB PCIe SSD) IPS Anti-Glare, Backlit KB, Fingerprint, Thunderbolt 4, Webcam, Wi-Fi 6E, IST SD Card, Win 11 Pro - 2023", "average_rating": "4.9", "Description": "['The HP EliteBook 640 is a cost-effective, powerful, and secure PC that allows easy standardization, protected by HP Wolf Security, while giving end-users the tools needed work from almost anywhere. Designed around the fundamental needs of enterprise businesses.'\n '12th Generation Intel 10-Core i5-1235U Processor (10 Cores 12 Threads, up to 4.4 GHz with Intel Turbo Boost Technology, 12MB L3 Cache); 16GB DDR4 Memory; 1TB PCIe M.2 SSD'\n '14\" FHD (1920 x 1080) IPS, Anti-Glare, narrow bezel, 45% NTSC, 250 nits Display; privacy camera; Integrated Intel Iris Xe Graphics functions as UHD Graphics - Expandable to 3 monitors via HDMI, Thunderbolt 4. Max resolution of the External Monitors: 4K (3840*2160) @60Hz'\n 'Thunderbolt 4 / USB4 40Gbps (Supports DisplayPort and Power Delivery), 3 x USB-A 3.0 / 3.1/3.2 Gen 1, HDMI 2.1, Headphone / microphone combo jack (3.5mm), RJ-45; Crystal-clear speakers; Intel Wi-Fi 6E AX211 (2 x 2) + Bluetooth 5.3'\n 'Disclosure: Brand New Computer has been resealed to upgrade the Memory or SSD. One-year warranty from the manufacturer. Three-year warranty for upgraded Memory/SSD for Issaquah Highlands Tech customers. Windows 11 Professional 64-bit - Ideal for School Education, Designers, Professionals, Small Business, Programmers, Streaming, Online Class, Remote Learning, Zoom Meeting, Video Conference, etc.']", "Price": "899.99"}
